{"location":null,"date":"2018-07-31","category":"Business","source":"GhanaWeb","image":null,"content":"<p>Business News of Tuesday, 31 July 2018<\/p><p>Source: citibusinessnews.com<\/p><p><a href=':\/\/artikel.php?ID=673202&nav=previous'>« Prev<\/a><\/p><p><a href=':\/\/artikel.php?ID=673202&nav=next'>Next »<\/a><\/p><p><a href=':\/\/artikel.php?ID=673202&comment=0#com'>Comments (1)<\/a><\/p><p><a href=':\/\/New-BoG-directive-to-prevent-bank-collapse-Nana-Otuo-673202?gallery=1'><\/a>Banking consultant, Nana Otuo Acheampong<\/p><p>Banking Consultant, Nana Otuo Acheampong is hopeful that the new directives on Financial Holding Companies should avert possible collapse of banks in the near future.\r\nThe Bank of Ghana in its latest directive for the financial sector, has outlined the operation of Finance Holding Companies which insists on restricted areas they cannot venture.\r\nThe Directive for Financial Holding Companies joins the list of rules and directives issued by the Bank of Ghana to sanitise the industry.\r\nThe document is in its draft stage and regulators are seeking input from stakeholders which will also determine the implementation date.\r\nAccording to Nana Otuo Acheampong, the directive is necessary following the recent developments including the collapse of two banks and the subject to life support of others.\r\n“Corporate governance effects have been cited as some of the reasons contributing to some of the problems of the two collapsed banks and those the central bank has put on administration,” he said.\r\nThe directive which comes two years after the passage of the Banks and Specialised Deposit Taking Institutions Act 930, may qualify as rather too late.\r\nThis is because it is needed to operationalise the provisions outlined in the Banks and SDI Act.\r\nBut Nana Otuo Acheampong maintains, the timing may just be right to sanitise the financial industry.\r\n“If you do any cursory research into the laws of Ghana versus LI, you will not be surprised to find that more than 80 percent of the laws do not have LIs so having the Directives coming out within two years may even be considered early,” he noted.\r\nWhile the Bank of Ghana is allowing Financial Holding Companies to restrict their work to raising funds to invest in-or provide support to its subsidiaries it is against the direct or indirect investments by a Financial Holding Company in non financial entities like commercial, agricultural or industrial activities.<\/p>","title":null,"errors":null}