{"location":null,"date":"2018-07-30","category":"Life style","source":"Citi News Room","image":".\/img\/Woman-sleeping.jpg","content":"<p>Counting sheep is just not working for an army of sleep-deprived people, figures show.<\/p><p>Recent studies suggest that a shocking 38 percent of adults here don’t get enough kip.<\/p><p>But experts agree lack of rest has a drastic effect on our mood and ­motivation.<\/p><p>So it is important to get the right number of winks – exactly 40, according to tradition.<\/p><p>And here are our top tips for how to bed down for a successful bout of shut-eye.<\/p><p>Sleep alone<\/p><p>Sharing a bed with your ­partner might feel comforting but it is not helping you doze off.<\/p><p>Couples who bed down ­together have lighter sleep and move around more in the night ­compared with those who have the covers to themselves.<\/p><p>They also experience less REM sleep – the rapid eye ­movement phase that is typically associated with dreaming and is so ­important ­because it allows the body ­to recharge and replenish.<\/p><p>Sleeping apart might not just save your rest but also your ­relationship.<\/p><p>A recent study found that ­people who sleep badly have a higher divorce rate, engage in more arguments and suffer from a lack of empathy.<\/p><p>Ditch the weekend lie-in<\/p><p>Sticking to a sleep schedule is the best way to tune your body into getting the best possible night’s sleep.<\/p><p>Our bodies need routine and predictability so avoid lying in at the weekends because it will only confuse your internal clock.<\/p><p>The best thing to do is to get up at the same time every day so your body gets used to it.<\/p><p>Do not eat before ­bedtime<\/p><p>As your body burns off calories from the food you eat it creates heat and a raised body temperature can interrupt a sound night’s sleep.<\/p><p>To make matters worse your body’s ­metabolism also slows down when you fall asleep, causing any ­undigested calories to be stored as fat and ­potentially lead to weight gain. Eating your supper three or four hours before bedtime is best because it allows your body time to digest and metabolise.<\/p><p>The eight-hour myth<\/p><p>It is a common misconception that eight hours’ sleep is the ­recommended amount needed by everyone each night. Sleep need is as individual as height. It is genetically determined.<\/p><p>But everyone is different when it comes to how much sleep they need in order to wake up rested and refreshed.<\/p><p>Some might survive off five while others will not feel at their best with less than nine.<\/p><p>Work out how much sleep you need to perform best the next day – to be focused and feel awake. Then you should ­consistently try to get this amount of shut-eye each night to ­maintain a healthy schedule.<\/p><p>Crack a window<\/p><p>Fresh air is beneficial to sleep because a build-up of carbon dioxide can disturb a good rest.<\/p><p>The accumulation of the gas as we exhale in our sleep will keep you tossing and turning all night long if a room is not ­properly ventilated.<\/p><p>The benefit of sleeping with a window open has been ­highlighted in studies that show lower CO2 levels mean we get a deep and more efficient rest.<\/p><p>The evidence is we then wake up less throughout the night.<\/p><p>–<\/p><p>Source: Mirror UK<\/p>","title":"Get a better night's sleep with 5 simple lifestyle changes","errors":null}